perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    bbox-1:
      target: 'http://localhost:5555/bbox-sync'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-2"
    bbox-2:
      target: 'http://localhost:5555/bbox-async'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-1"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'