perf/scaling-heavy_load.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    multi-node:
      target: 'http://localhost:5556'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-multi-node"
        
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 3
    - name: Ramp 2
      duration: 30
      arrivalRate: 4
    - name: Ramp 3
      duration: 30
      arrivalRate: 5
    - name: Ramp 4
      duration: 30
      arrivalRate: 6
    - name: Ramp 5
      duration: 30
      arrivalRate: 7
    - name: Ramp 6
      duration: 30
      arrivalRate: 8
    
scenarios:
  - name: HeavyLoad (/heavyLoad)
    flow:
      - get:
          url: '/heavyLoad/'